doc/org-mode/elements/restful_form.org
# vim: ts=3 sw=3 et ft=org
#+TITLE: restful\_form Element
#+STYLE: <LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
#+AUTHOR: Steffen Panning
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[http://nitrogenproject.com][Home]] | [[file:../index.org][Getting Started]] | [[file:../api.org][API]] | [[file:../elements.org][*Elements*]] | [[file:../actions.org][Actions]] | [[file:../validators.org][Validators]] | [[file:../handlers.org][Handlers]] | [[file:../config.org][Configuration Options]] | [[file:../advanced.org][Advanced Guides]] | [[file:../troubleshooting.org][Troubleshooting]] | [[file:../about.org][About]]

* RESTful Form Element - #restful\_form {}

  The #restful\_form{} element produces an HTML form element.
  The form element is necessary if your website has to work without
  javascript. It is _not_ necessary for a pure ajax/javascript driven
  website. 
 
** Usage

#+BEGIN_SRC erlang
   #restful_form { 
      method=post|get,
      action="/formdest",
      enctype="multipart/form-data",
      body=FormElements
   }
#+END_SRC

** Attributes

   + method - (/string or atom/) :: Set the HTTP request-method (typically
                            =post= or =get=).

   + action - (/string/) :: Set the target-url of the form submit. If
                            left blank, the same page module is used as
                            target.

   + target - (/string or atom/) :: Set the HTML =target= attribute, which can
                             be used for redirecting the form submission to a 
                             new window, or to a frame. If left blank, will
                             just target the current window.

   + enctype - (/string/) :: Sets the encoding for the form transmission.

   + body    - (/string/) :: Contains the elements of the form


** See Also

   + [[./base.html][Base]]

   + [[./link.html][Link]]

   + [[./textbox.html][Textbox]]

   + [[./password.html][Password]]

   + [[./textarea.html][Textarea]]

   + [[./checkbox.html][Checkbox]]

   + [[./dropdown.html][Dropdown]]

   + [[./option.html][Dropdown Option]]
   
   + [[./restful_submit.org][RESTful Submit]]

   + [[./restful_reset.org][RESTful Reset]]

   + [[./restful_upload.org][RESTful Upload]]

   + [[http://nitrogenproject.com/demos/restful][RESTful Forms Demo]]

