doc/html/elements/restful_form.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>restful_form Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="restful_form Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:51 CST"/>
<meta name="author" content="Steffen Panning"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">restful_form Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 RESTful Form Element - #restful_form {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RESTful Form Element - #restful_form {}</h2>
<div class="outline-text-2" id="text-1">


<p>
  The #restful_form{} element produces an HTML form element.
  The form element is necessary if your website has to work without
  javascript. It is <span style="text-decoration:underline;">not</span> necessary for a pure ajax/javascript driven
  website. 
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">restful_form</span> { 
   method=post|get,
   action=<span class="org-string">"/formdest"</span>,
   enctype=<span class="org-string">"multipart/form-data"</span>,
   body=<span class="org-variable-name">FormElements</span>
}
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>method - (<i>string or atom</i>)</dt><dd>Set the HTTP request-method (typically
                            <code>post</code> or <code>get</code>).

</dd>
<dt>action - (<i>string</i>)</dt><dd>Set the target-url of the form submit. If
                            left blank, the same page module is used as
                            target.

</dd>
<dt>target - (<i>string or atom</i>)</dt><dd>Set the HTML <code>target</code> attribute, which can
                             be used for redirecting the form submission to a 
                             new window, or to a frame. If left blank, will
                             just target the current window.

</dd>
<dt>enctype - (<i>string</i>)</dt><dd>Sets the encoding for the form transmission.

</dd>
<dt>body    - (<i>string</i>)</dt><dd>Contains the elements of the form
</dd>
</dl>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="./base.html">Base</a>

</li>
<li><a href="./link.html">Link</a>

</li>
<li><a href="./textbox.html">Textbox</a>

</li>
<li><a href="./password.html">Password</a>

</li>
<li><a href="./textarea.html">Textarea</a>

</li>
<li><a href="./checkbox.html">Checkbox</a>

</li>
<li><a href="./dropdown.html">Dropdown</a>

</li>
<li><a href="./option.html">Dropdown Option</a>

</li>
<li><a href="./restful_submit.html">RESTful Submit</a>

</li>
<li><a href="./restful_reset.html">RESTful Reset</a>

</li>
<li><a href="./restful_upload.html">RESTful Upload</a>

</li>
<li><a href="http://nitrogenproject.com/demos/restful">RESTful Forms Demo</a>
</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:51 CST</p>
<p class="author">Author: Steffen Panning</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/restful_form.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
